In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math as math
frame = pd.read_csv('./Data/mammals.csv')

In [3]:
frame.head()

              name     body  brain
0       Arctic fox    3.385   44.5
1       Owl monkey    0.480   15.5
2  Mountain beaver    1.350    8.1
3              Cow  465.000  423.0
4        Grey wolf   36.330  119.5

In [4]:
frame.columns

Index(['name', 'body', 'brain'], dtype='object')

In [8]:
frame.columns =['name','bodyKg','brainKg']

In [9]:
frame.head()

              name   bodyKg  brainKg
0       Arctic fox    3.385     44.5
1       Owl monkey    0.480     15.5
2  Mountain beaver    1.350      8.1
3              Cow  465.000    423.0
4        Grey wolf   36.330    119.5

In [10]:
newColumnNames = {'bodyKg':'body_kg','brainKg':'brain_kg'}

In [12]:
frame.rename(columns=newColumnNames,inplace=True)

In [13]:
frame.head()

              name  body_kg  brain_kg
0       Arctic fox    3.385      44.5
1       Owl monkey    0.480      15.5
2  Mountain beaver    1.350       8.1
3              Cow  465.000     423.0
4        Grey wolf   36.330     119.5

In [14]:
frame = pd.read_csv('./Data/mammals.csv',index_col='name')

In [15]:
frame

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Cow              465.000  423.0
Grey wolf         36.330  119.5
...                  ...    ...
Brazilian tapir  160.000  169.0
Tenrec             0.900    2.6
Phalanger          1.620   11.4
Tree shrew         0.104    2.5
Red fox            4.235   50.4

[62 rows x 2 columns]

In [16]:
frame.rename(index = {'Cow':'Land cow'},inplace=True)

In [17]:
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Land cow         465.000  423.0
Grey wolf         36.330  119.5

In [18]:
frameCopy = frame

In [19]:
frameCopy.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Land cow         465.000  423.0
Grey wolf         36.330  119.5

In [22]:
frameCopy.loc['Arctic fox', 'body'] = 5

In [23]:
frame.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land cow         465.00  423.0
Grey wolf         36.33  119.5

In [24]:
frameCopy = frame.copy()

In [25]:
frameCopy.loc['Grey wolf', 'body'] = 40

In [26]:
frameCopy.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land cow         465.00  423.0
Grey wolf         40.00  119.5

In [27]:
frame.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land cow         465.00  423.0
Grey wolf         36.33  119.5